[
{"logo_url": "https://d3gecv9w1cv0iw.cloudfront.net/image/160/138/13359.do", "title": "The Hudson Economics Group,Ltd.", "sub_title": "The Hudson Economics Group,Ltd.", "primary_location": null, "area_of_expertise": "Marketing Consulting in the United States", "about": "We specialize in the global stone and tile industry.", "website": null, "languages_spoken": null, "page_url": "https://www.globaltrade.net/international-trade-import-exports/expert-service-provider-p/The-Hudson-Economics-Group-Ltd.html"},
{"logo_url": "https://d3gecv9w1cv0iw.cloudfront.net/image/160/138/13015.do", "title": "Linnea LLC", "sub_title": "Linnea LLC", "primary_location": null, "area_of_expertise": "Custom Manufacturing in the United States", "about": "Linnea is defined by clean lines and solid construction. Linnea designs and manufactures the finest contemporary architectural hardware. Inspired by the twinflower after which it is named, Linnea integrates refined form and reliable function. We offer numerous solutions for doors, cabinets, kitchens and baths. Our passion is marine-grade stainless steel, which recycles well and excels in nearly all environments without rusting and our unique Oregon Bronze line is a nod to our Northwest roots. The superior craftsmanship of Linnea architectural hardware is evident in the details that others have yet to successfully imitate. In the meantime, we strive to create innovative designs that will last a lifetime.", "website": null, "languages_spoken": null, "page_url": "https://www.globaltrade.net/international-trade-import-exports/expert-service-provider-p/Linnea-LLC.html"},
{"logo_url": "https://d3gecv9w1cv0iw.cloudfront.net/image/160/138/12924.do", "title": "Northern Galaxy Corporation", "sub_title": "Northern Galaxy Corporation", "primary_location": null, "area_of_expertise": "Custom Manufacturing in the United States", "about": "Internationally recognized expert, author and speaker on trade flows, manufacturing, supply chain strategies and quality control.  Registered business broker (Illinois, USA) providing companies outside the USA with acquisition services including post-aqcuisition integration.", "website": null, "languages_spoken": null, "page_url": "https://www.globaltrade.net/international-trade-import-exports/expert-service-provider-p/Michael-Hetzel.html"},
{"logo_url": "https://d3gecv9w1cv0iw.cloudfront.net/image/160/138/16693.do", "title": "Streamline Financial LLc", "sub_title": "Streamline Financial LLc", "primary_location": null, "area_of_expertise": "Letter of Credit in the United States", "about": "Streamline Financial LLC is a United States based modern and dynamic boutique finance company, We represent the traditional Banking practices of discretion, strength, reliability and performance. As an international investment company we specialize in providing financing through alternate means and sources, through debt, Joint Venture investment or a combination, usually providing financing of a qualified project.", "website": null, "languages_spoken": "English , Italian", "page_url": "https://www.globaltrade.net/international-trade-import-exports/expert-service-provider-p/Streamline-Financial-LLc-2.html"},
{"logo_url": "https://d3gecv9w1cv0iw.cloudfront.net/image/160/138/12838.do", "title": "Diamond Forwarding International", "sub_title": "Diamond Forwarding International", "primary_location": null, "area_of_expertise": "Freight Forwarder in the United States", "about": "Diamond forwarding International provides a complete range of Domestic and International shipping. We can cordinate both export and import services to and from any place in the world. Our goal is to provide the best possible service to all our clients, no matter how big or small. Diamond Forwarding International also provides Customs Brokerage throughout the united states. If Diamond Forwarding International is not your current forwarder please pick up the phone and call us, or you can just click for a quote.  Diamondforwarding.com", "website": null, "languages_spoken": null, "page_url": "https://www.globaltrade.net/international-trade-import-exports/expert-service-provider-p/Diamond--Forwarding-International.html"},
{"logo_url": "https://d3gecv9w1cv0iw.cloudfront.net/image/160/138/12362.do", "title": "Shipping Services Italia", "sub_title": "Shipping Services Italia", "primary_location": null, "area_of_expertise": "Freight Forwarder in the United States", "about": "Address: 580 Broadway, Suite 712, New York, NY 10012 Telephone:  +1 646 613-9009", "website": null, "languages_spoken": "English , Arabic, Chinese, French, Italian, Portuguese, Spanish", "page_url": "https://www.globaltrade.net/international-trade-import-exports/expert-service-provider-p/SHIPPING-SERVICES-ITALIA.html"},
{"logo_url": "https://d3gecv9w1cv0iw.cloudfront.net/image/160/138/1993.do", "title": "Mfi International Manufacturing Llc", "sub_title": "Mfi International Manufacturing Llc", "primary_location": null, "area_of_expertise": "Custom Manufacturing in Mexico", "about": "MFI International Manufacturing LLC has been successfully delivering low cost manufacturing in Mexico solutions for more than 30 years to companies that build its competitive advantage from the benefits associated with doing business in this privileged located country. Our bi-national, bi-cultural staff with decades of experience in manufacturing in Mexico is the key element for a successful and profitable business operation. With headquarters in El Paso, Texas, and site selection options on both sides of the U.S.-Mexico border, our portfolio of service offerings includes contract manufacturing and shelter operations management. MFI International is committed to serving companies in a way that will enable them to succeed in achieving their strategic goals and profitability objectives. Specialties: Manufacturing in Mexico, Shelter Operations Management, Contract manufacturing", "website": null, "languages_spoken": null, "page_url": "https://www.globaltrade.net/international-trade-import-exports/expert-service-provider-p/MFI-International.html"},
{"logo_url": "https://d3gecv9w1cv0iw.cloudfront.net/image/160/138/15288.do", "title": "Business Funding Makeover, Inc.", "sub_title": "Business Funding Makeover, Inc.", "primary_location": null, "area_of_expertise": null, "about": "Business Funding Makeover is a business credit funding and building company based out in San Diego. We help small businesses build their business credit to afford products and services regardless of their personal credit condition. Our 6 step ‘Business Credit Builder Program’ guarantees $50,000 in your corporate credit, within 6 months! Visit http://www.businessfundingmakeover.com/ &amp; http://www.businessfundingmakeover.com/business-credit/how-it-works.html to know more on us and sign up for free!", "website": null, "languages_spoken": "English", "page_url": "https://www.globaltrade.net/international-trade-import-exports/expert-service-provider-p/Business-Funding-Makeover--Inc.html"},
{"logo_url": "https://d3gecv9w1cv0iw.cloudfront.net/image/160/138/9237.do", "title": "JDesigns - Global Freight Transportation Division", "sub_title": "JDesigns - Global Freight Transportation Division", "primary_location": null, "area_of_expertise": "Freight Forwarder in the United States", "about": "We provide: Supply chain management, Domestic and Global Transportation Logistics including: Truckload, Less-than-Truckload, Heavy Haul, Expedited Ground, Air, Rain Intermodal, Ocean Freight Forwarding, Warehousing. Reliable door-to-door air freight service and International. Let us help you move your freight domestic or international. Expedited Worldwide Service – including Canada. All inclusive price covers pickup, transportation, customs clearance and delivery. Licensed Customs Brokers in more than 140 countries provide expertise on local routes and regulations. “Wheels-up” Customs clearance – electronic pre-approval of exports and imports. Defined transit time – from origin to destination. Complete online visibility and delivery tracking status. Waybill/Government/Customs document preparation For more information visit our website: www.JDesignsLLC.com", "website": null, "languages_spoken": "English", "page_url": "https://www.globaltrade.net/international-trade-import-exports/expert-service-provider-p/JDesigns---Global-Freight-Transportation-Division.html"},
{"logo_url": "https://d3gecv9w1cv0iw.cloudfront.net/image/160/138/8841.do", "title": "High Beam Global", "sub_title": "High Beam Global", "primary_location": null, "area_of_expertise": "Market Research in the United States", "about": "HBG is a full service Market Research agency providing research and support services to companies ranging from boutique research agencies, market research giants and consulting firms globally. Our service offerings include multi mode Data Collection (both quantitative and qualitative techniques), Survey Programming &amp; Hosting, Data Processing and range of back-end support services (data coding/punching, qualitative transcriptions and translations). We combine a client-focused approach with robust project management to offer a unique experience to our clients. Our core team consists of passionate market research professionals with rich multi-function experience in domestic and international market research and knowledge management processes. Leadership at HB Global comes with vast experience through their senior level association with leading Market Research and Consulting firms. Our Strengths: • Multi-lingual CATI center with over 250 interviewers • Partner network covering over 40 locations worldwide • Access to all large panels across the globe • Handpicked partners, ensuring quality and understanding of the local geography • Top class syndication services for online and offline data collection • Robust Project Management • Responsiveness to customer needs • Adherence to deadlines • Measurable results", "website": null, "languages_spoken": "English", "page_url": "https://www.globaltrade.net/international-trade-import-exports/expert-service-provider-p/High-Beam-Global.html"},
{"logo_url": "https://d3gecv9w1cv0iw.cloudfront.net/image/160/138/9514.do", "title": "Western Union Business Solutions", "sub_title": "Western Union Business Solutions", "primary_location": "Montvale, NJ, United States", "area_of_expertise": "Foreign Exchange in the United States", "about": "Western Union Business Solutions is a leading supplier of foreign exchange services and a trusted provider of international business-to-business payments.  We enable companies of all sizes to send and receive international payments, manage currency exposures and capitalize on global market opportunities. With a suite of products and services tailored specifically for business needs, a deep expertise in foreign transactions, access to over 140 currencies and a global financial network that spans more than 200 countries and territories, we help companies spend less time managing international payments and more time growing their businesses.", "website": "http://www.business.westernunion.com", "languages_spoken": null, "page_url": "https://www.globaltrade.net/international-trade-import-exports/expert-service-provider-p/Western-Union-Business-Solutions.html"},
{"logo_url": "https://d3gecv9w1cv0iw.cloudfront.net/image/160/138/18936.do", "title": "American Digital Services", "sub_title": "American Digital Services", "primary_location": "Albany, NY, United States", "area_of_expertise": "Media/Graphic Design in the United States", "about": "American Digital Services has been providing Web Hosting, Content Management Solutions, Email Security, IT Support, and Security for over 10 years. We give you enterprise level services without the hassle of managing the technology or the enterprise cost.", "website": "http://www.americandigitalservices.com", "languages_spoken": null, "page_url": "https://www.globaltrade.net/international-trade-import-exports/expert-service-provider-p/planetnoc-dan-horning.html"},
{"logo_url": "https://d3gecv9w1cv0iw.cloudfront.net/image/160/138/13259.do", "title": "Fast Freight", "sub_title": "Fast Freight", "primary_location": null, "area_of_expertise": "Air Freight in the United States", "about": "Address: 3475 NW 60th Street, Miami, FL-33142 Telephone:  +1 786 629-7726", "website": null, "languages_spoken": null, "page_url": "https://www.globaltrade.net/international-trade-import-exports/expert-service-provider-p/Arthur--Moroz.html"},
{"logo_url": "https://d3gecv9w1cv0iw.cloudfront.net/image/160/138/14608.do", "title": "Export Enterprises", "sub_title": "Export Enterprises", "primary_location": "Paris, France", "area_of_expertise": "B2B Marketing in the United States", "about": "Your B2B Digital solutions provider for International Trade Tools  Non-Financial Services  Non financial services for banks, NGO and goverment organizations  are in strong expansion and we at Export Enterprises are the backbone of growth in this emerging industry.  More and more banks are developing strategies and creating SME units to cater to clients that fall in the SME category, especially SMEs searching for foreign expansion. Our Services Export Enterprises provide banks, NGOs and government organizations with international trade resources, SME portals, online communities and B2B marketplaces to be made available to the international business banking client.  The overall result provides these clients and SMEs with a one stop shop of tools, resources, and content vital to successfully and securely growing an international business. Such tools included; interactive maps of import/export flows, how to articles on business development and international banking, market reports, shipping documents, custom duties; country profiles, tax guides, denied party screening, landed cost calculators and more", "website": "http://www.export-entreprises.com", "languages_spoken": "English", "page_url": "https://www.globaltrade.net/international-trade-import-exports/expert-service-provider-p/Export-Enterprises.html"},
{"logo_url": "https://d3gecv9w1cv0iw.cloudfront.net/image/160/138/9295.do", "title": "Global Mercato", "sub_title": "Global Mercato", "primary_location": "Easton, United States", "area_of_expertise": "Free Trade Zone in the United States", "about": "My company Global Mercato is a leading import export company dealing exclusively with water. I have major suppliers of water for any buyers that need it URGENTLY. I am an expert in finding buyers and suppliers. I've worked with companies in other countries looking for products made here in the United States. I also specialize in commodities from other countries to import to the United States. I'm looking to build long term relationships with companies worldwide to do business with.", "website": null, "languages_spoken": "English", "page_url": "https://www.globaltrade.net/international-trade-import-exports/expert-service-provider-p/Global-Mercato-2.html"},
{"logo_url": "https://d3gecv9w1cv0iw.cloudfront.net/image/160/138/9439.do", "title": "ENLASO Corporation", "sub_title": "ENLASO Corporation", "primary_location": "Boulder, CO, United States", "area_of_expertise": null, "about": "ENLASO is a full service globalization firm with over 40 years of experience assisting companies with every aspect of their international market needs.  From translation and localization, to market research and market penetration strategies, you can count on our network of experts and thousands of in-country resources to help your business accomplish exactly the success you envision.", "website": "http://www.enlaso.com", "languages_spoken": "English", "page_url": "https://www.globaltrade.net/international-trade-import-exports/expert-service-provider-p/ENLASO-Corporation.html"},
{"logo_url": "https://d3gecv9w1cv0iw.cloudfront.net/image/160/138/2298.do", "title": "Fastfix Inc.", "sub_title": "Fastfix Inc.", "primary_location": "New York, United States", "area_of_expertise": "Ocean Freight in the United States", "about": "WEB BASED DO-IT-YOURSELF SOLUTION FOR GLOBAL DRY BULK TRADES We are Fastfix Inc. FastFix™ system facilitates ocean freight for dry bulk shipments. Using our DO-IT-YOURSELF solution online you can post shipments directly on the system and negotiate suitable ship space. System is useful for established Traders that ship dry bulks such as coal, iron ore, minerals, grains, rice, wheat, cement etc to any major functioning port in the world. Our system provides GLOBAL TRADE INFRASTRUCTURE for all major dry bulk commodities that are transported by ship. You may transact: - Full Cargo Orders (above 5,000mt/10,000mt/parcel) - Part Cargo Orders (under 5,000mt) - COAs - TCs Covers 9600 ports worldwide and 100+ commodities.  REGISTER for FREE  in suitable category and use PROMO: \"free90\" to get FREE ACCESS test drive for 90 days before we launch our website to rest of the market. Many more upgrades planned for the upcoming launch.", "website": "http://www.fastfixinc.com", "languages_spoken": "English", "page_url": "https://www.globaltrade.net/international-trade-import-exports/expert-service-provider-p/Fastfix-Inc.html"},
{"logo_url": "https://d3gecv9w1cv0iw.cloudfront.net/image/160/138/10794.do", "title": "GCL Overseas BVBA", "sub_title": "GCL Overseas BVBA", "primary_location": null, "area_of_expertise": "Containerization Services in China", "about": "GCL-Overseas provides a wide range of services in logistics for shipping all types of products. We offer a dynamic array of services from exporting and importing personal effects to providing the logistics for project cargo, we cover it all in a professional and peronsal way. Our clientele range from Small Family owned business to Large Industrial Manufacturers and Traders. Our well-experienced staff provides our customers with the guidance and coordination to get the shipments to their final destination - without any hassle. Our operations in the Port of Antwerp cater to all modes of international and domestic transportation, for both Import and Export as well as with N.V.O.C.C operations and customs clearance. We provide in-house worldwide transportation of cargo by Sea and Air.", "website": null, "languages_spoken": "English", "page_url": "https://www.globaltrade.net/international-trade-import-exports/expert-service-provider-p/GCL-OVERSEAS-BVBA.html"},
{"logo_url": "https://d3gecv9w1cv0iw.cloudfront.net/image/160/138/9248.do", "title": "Dunli Group USA", "sub_title": "Dunli Group USA", "primary_location": "Long Island City, United States", "area_of_expertise": "Custom Manufacturing in the United States", "about": "We are ISO9001 Quality System and ISO14001 Environment Management System certified. With over 2,500 employees and a factory floor space of 3 million square feet, Dunli Group manufactures a diverse variety of products: medical beds and related accessories; store fixtures, garment racks and displays; numerous models of industrial fans and blowers, fan motors and fan guards; housewares for the kitchen, bath, garden and more.", "website": "http://www.dunliusa.com", "languages_spoken": "English", "page_url": "https://www.globaltrade.net/international-trade-import-exports/expert-service-provider-p/Dunli-Group-USA.html"},
{"logo_url": "https://d3gecv9w1cv0iw.cloudfront.net/image/160/138/14163.do", "title": "MSW INVESTORS INC", "sub_title": "MSW INVESTORS INC", "primary_location": null, "area_of_expertise": "Credit Card Services in the United States", "about": "The company acquires a myriad of diversified undervalued assets, (real estate, notes, securities, small businesses and other alternative assets) for profit.  MIC finances the acquisitions with private funds from (you) the investor.  In return the investor receives one  of the bundle of benefits,( i.e. annual accumulative interest, profit sharing, bonus income) on their investment.  The investor’s principal and all accumulated benefits /interest and fees are included in the scheduled payments", "website": null, "languages_spoken": "English", "page_url": "https://www.globaltrade.net/international-trade-import-exports/expert-service-provider-p/MSW-INVESTORS-INC.html"}
]